print("Hello, World!")

#ASCII Art of ship
text="""                       |
                              /|\
                             / | \
                            /  |  \
                           /   |   \
                          /    |    \
                         /     |     \
                        /______|______\
                       /      /|     /
                      /______/ |____/
                             | |
                     ________|_|____________
                  .-'         /            /|
               .-'___________/____________/ |
              /___________________________| /
              \                           \/
               `-._____________________.-'
~~~~~~~~~~~~~~~~~~~~\_______________/~~~~~~~~~~~~~~~~
       ~~~~~~~        ~~~~~~~~        ~~~~~~~
"""

#เพิ่มกรอบล้อมรอบและข้อความเล็ก ๆ
border = "*" * 50
messege = "Welcome to the Ship ASCII Art!"

print(border)
print(text)
print(messege.center(50))    
print(border)

                 